def main():
    # todo: Определить в коде переменные:
    # 1. Целочисленного типа
    int_var = 42
    # 2. Вещественного типа
    float_var = 3.14
    # 3. Логического типа
    bool_var = True
    # 4. Строкового типа
    string_var = "Hello, World!"
    # 5. Пустого типа
    none_var = None
    # Вывести их типы

    print(f"1. Integer type: {type(int_var)}")
    print(f"2. Float type: {type(float_var)}")
    print(f"3. Boolean type: {type(bool_var)}")
    print(f"4. String type: {type(string_var)}")
    print(f"5. None type: {type(none_var)}")

if __name__ == "__main__":
    main()
